print('🌸'*11)
print('🌸Статус вашего заказа🌸')
print(('🌸'*11))
print()

match status:
    case 'cancelled':
        print('Статус: Отменен😋')
        print('Описание: Мы просто взяли и отменили заказ')
        print('Примерное время ожидания: ♾️ дней')
        print('Рекомендации: больше не заказывайте у нас')

    case "pending":
        print('Статус: В ожидании🤢')
        print('Описание: туда-сюда')
        print(f'Примерное время ожидания: {days} дней')
        print('Рекомендации: ждать у моря погоды')

    case "processing":
        print('Статус: В обработке🥱')
        print('Описание: лентяево чёто делать')
        print(f'Примерное время ожидания: {days} дней')
        print('Рекомендации: всё будет')

    case "shipped":
        print('Статус: отправлено🛴💨')
        print('Описание: заказ едет на хромой блохе с того берега моря, которое зайцу не перелететь, орлу не перебежать')
        print(f'Примерное время ожидания: {days} дней')
        print('Рекомендации: проверять статус заказа каждые 5 минут')

    case "delivered":
        print('Статус: доставлено🥳')
        print('Описание: спектакль окончен, гааааснееет свет')
        print('Примерное время ожидания: ВСЁ')
        print('Рекомендации: прочитайте Грозовой перевал, чтобы снести последние нервные клетки')

    case _:
        print('🤬Ошибка: Неизвестный статус')
